; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l20_p20_c20_g20_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(at crate16 depot)
	(at crate17 depot)
	(at crate18 depot)
	(at crate19 depot)
	(at crate20 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 food)
	(crate-content crate6 food)
	(crate-content crate7 food)
	(crate-content crate8 food)
	(crate-content crate9 medicine)
	(crate-content crate10 medicine)
	(crate-content crate11 medicine)
	(crate-content crate12 medicine)
	(crate-content crate13 medicine)
	(crate-content crate14 medicine)
	(crate-content crate15 medicine)
	(crate-content crate16 medicine)
	(crate-content crate17 medicine)
	(crate-content crate18 medicine)
	(crate-content crate19 medicine)
	(crate-content crate20 medicine)
	(at person1 loc18)
	(at person2 loc19)
	(at person3 loc6)
	(at person4 loc9)
	(at person5 loc2)
	(at person6 loc18)
	(at person7 loc2)
	(at person8 loc4)
	(at person9 loc10)
	(at person10 loc15)
	(at person11 loc6)
	(at person12 loc11)
	(at person13 loc2)
	(at person14 loc12)
	(at person15 loc3)
	(at person16 loc7)
	(at person17 loc5)
	(at person18 loc2)
	(at person19 loc10)
	(at person20 loc12)
	(person-needs person1 food)
	(person-needs person1 medicine)
	(person-needs person2 food)
	(person-needs person2 medicine)
	(person-needs person3 food)
	(person-needs person3 medicine)
	(person-needs person4 medicine)
	(person-needs person5 medicine)
	(person-needs person6 medicine)
	(person-needs person7 food)
	(person-needs person7 medicine)
	(person-needs person9 food)
	(person-needs person10 food)
	(person-needs person11 food)
	(person-needs person11 medicine)
	(person-needs person12 food)
	(person-needs person13 medicine)
	(person-needs person14 medicine)
	(person-needs person17 medicine)
	(person-needs person19 medicine)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 food)
	(person-has person1 medicine)
	(person-has person2 food)
	(person-has person2 medicine)
	(person-has person3 food)
	(person-has person3 medicine)
	(person-has person4 medicine)
	(person-has person5 medicine)
	(person-has person6 medicine)
	(person-has person7 food)
	(person-has person7 medicine)
	(person-has person9 food)
	(person-has person10 food)
	(person-has person11 food)
	(person-has person11 medicine)
	(person-has person12 food)
	(person-has person13 medicine)
	(person-has person14 medicine)
	(person-has person17 medicine)
	(person-has person19 medicine)
	))
)

; plan
1. (grab-arm1 drone1 crate4 depot)
   deleted: (arm1-free drone1) (at crate4 depot)
   added: (arm1-load drone1 crate4)
   goals met: 1 of 21
2. (grab-arm2 drone1 crate6 depot)
   deleted: (arm2-free drone1) (at crate6 depot)
   added: (arm2-load drone1 crate6)
   goals met: 1 of 21
3. (move-drone drone1 depot loc19)
   deleted: (at drone1 depot)
   added: (at drone1 loc19)
   goals met: 0 of 21
4. (deliver-arm2 drone1 person2 crate6 food loc19)
   deleted: (arm2-load drone1 crate6) (person-needs person2 food)
   added: (arm2-free drone1) (person-has person2 food)
   goals met: 1 of 21
5. (move-drone drone1 loc19 depot)
   deleted: (at drone1 loc19)
   added: (at drone1 depot)
   goals met: 2 of 21
6. (grab-arm2 drone1 crate7 depot)
   deleted: (arm2-free drone1) (at crate7 depot)
   added: (arm2-load drone1 crate7)
   goals met: 2 of 21
7. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 1 of 21
8. (deliver-arm2 drone1 person3 crate7 food loc6)
   deleted: (arm2-load drone1 crate7) (person-needs person3 food)
   added: (arm2-free drone1) (person-has person3 food)
   goals met: 2 of 21
9. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 3 of 21
10. (grab-arm2 drone1 crate8 depot)
   deleted: (arm2-free drone1) (at crate8 depot)
   added: (arm2-load drone1 crate8)
   goals met: 3 of 21
11. (move-drone drone1 depot loc2)
   deleted: (at drone1 depot)
   added: (at drone1 loc2)
   goals met: 2 of 21
12. (deliver-arm2 drone1 person7 crate8 food loc2)
   deleted: (arm2-load drone1 crate8) (person-needs person7 food)
   added: (arm2-free drone1) (person-has person7 food)
   goals met: 3 of 21
13. (move-drone drone1 loc2 depot)
   deleted: (at drone1 loc2)
   added: (at drone1 depot)
   goals met: 4 of 21
14. (grab-arm2 drone1 crate2 depot)
   deleted: (arm2-free drone1) (at crate2 depot)
   added: (arm2-load drone1 crate2)
   goals met: 4 of 21
15. (move-drone drone1 depot loc10)
   deleted: (at drone1 depot)
   added: (at drone1 loc10)
   goals met: 3 of 21
16. (deliver-arm2 drone1 person9 crate2 food loc10)
   deleted: (arm2-load drone1 crate2) (person-needs person9 food)
   added: (arm2-free drone1) (person-has person9 food)
   goals met: 4 of 21
17. (move-drone drone1 loc10 depot)
   deleted: (at drone1 loc10)
   added: (at drone1 depot)
   goals met: 5 of 21
18. (grab-arm2 drone1 crate5 depot)
   deleted: (arm2-free drone1) (at crate5 depot)
   added: (arm2-load drone1 crate5)
   goals met: 5 of 21
19. (move-drone drone1 depot loc15)
   deleted: (at drone1 depot)
   added: (at drone1 loc15)
   goals met: 4 of 21
20. (deliver-arm2 drone1 person10 crate5 food loc15)
   deleted: (arm2-load drone1 crate5) (person-needs person10 food)
   added: (arm2-free drone1) (person-has person10 food)
   goals met: 5 of 21
21. (move-drone drone1 loc15 depot)
   deleted: (at drone1 loc15)
   added: (at drone1 depot)
   goals met: 6 of 21
22. (grab-arm2 drone1 crate3 depot)
   deleted: (arm2-free drone1) (at crate3 depot)
   added: (arm2-load drone1 crate3)
   goals met: 6 of 21
23. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 5 of 21
24. (move-drone drone1 loc5 loc6)
   deleted: (at drone1 loc5)
   added: (at drone1 loc6)
   goals met: 5 of 21
25. (deliver-arm2 drone1 person11 crate3 food loc6)
   deleted: (arm2-load drone1 crate3) (person-needs person11 food)
   added: (arm2-free drone1) (person-has person11 food)
   goals met: 6 of 21
26. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 7 of 21
27. (grab-arm2 drone1 crate1 depot)
   deleted: (arm2-free drone1) (at crate1 depot)
   added: (arm2-load drone1 crate1)
   goals met: 7 of 21
28. (move-drone drone1 depot loc11)
   deleted: (at drone1 depot)
   added: (at drone1 loc11)
   goals met: 6 of 21
29. (deliver-arm2 drone1 person12 crate1 food loc11)
   deleted: (arm2-load drone1 crate1) (person-needs person12 food)
   added: (arm2-free drone1) (person-has person12 food)
   goals met: 7 of 21
30. (move-drone drone1 loc11 depot)
   deleted: (at drone1 loc11)
   added: (at drone1 depot)
   goals met: 8 of 21
31. (grab-arm2 drone1 crate13 depot)
   deleted: (arm2-free drone1) (at crate13 depot)
   added: (arm2-load drone1 crate13)
   goals met: 8 of 21
32. (move-drone drone1 depot loc18)
   deleted: (at drone1 depot)
   added: (at drone1 loc18)
   goals met: 7 of 21
33. (deliver-arm2 drone1 person6 crate13 medicine loc18)
   deleted: (arm2-load drone1 crate13) (person-needs person6 medicine)
   added: (arm2-free drone1) (person-has person6 medicine)
   goals met: 8 of 21
34. (move-drone drone1 loc18 depot)
   deleted: (at drone1 loc18)
   added: (at drone1 depot)
   goals met: 9 of 21
35. (grab-arm2 drone1 crate9 depot)
   deleted: (arm2-free drone1) (at crate9 depot)
   added: (arm2-load drone1 crate9)
   goals met: 9 of 21
36. (move-drone drone1 depot loc17)
   deleted: (at drone1 depot)
   added: (at drone1 loc17)
   goals met: 8 of 21
37. (move-drone drone1 loc17 loc18)
   deleted: (at drone1 loc17)
   added: (at drone1 loc18)
   goals met: 8 of 21
38. (deliver-arm1 drone1 person1 crate4 food loc18)
   deleted: (arm1-load drone1 crate4) (person-needs person1 food)
   added: (arm1-free drone1) (person-has person1 food)
   goals met: 9 of 21
39. (move-drone drone1 loc18 loc2)
   deleted: (at drone1 loc18)
   added: (at drone1 loc2)
   goals met: 9 of 21
40. (deliver-arm2 drone1 person5 crate9 medicine loc2)
   deleted: (arm2-load drone1 crate9) (person-needs person5 medicine)
   added: (arm2-free drone1) (person-has person5 medicine)
   goals met: 10 of 21
41. (move-drone drone1 loc2 depot)
   deleted: (at drone1 loc2)
   added: (at drone1 depot)
   goals met: 11 of 21
42. (grab-arm2 drone1 crate10 depot)
   deleted: (arm2-free drone1) (at crate10 depot)
   added: (arm2-load drone1 crate10)
   goals met: 11 of 21
43. (move-drone drone1 depot loc2)
   deleted: (at drone1 depot)
   added: (at drone1 loc2)
   goals met: 10 of 21
44. (deliver-arm2 drone1 person7 crate10 medicine loc2)
   deleted: (arm2-load drone1 crate10) (person-needs person7 medicine)
   added: (arm2-free drone1) (person-has person7 medicine)
   goals met: 11 of 21
45. (move-drone drone1 loc2 loc8)
   deleted: (at drone1 loc2)
   added: (at drone1 loc8)
   goals met: 11 of 21
46. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 12 of 21
47. (grab-arm2 drone1 crate11 depot)
   deleted: (arm2-free drone1) (at crate11 depot)
   added: (arm2-load drone1 crate11)
   goals met: 12 of 21
48. (move-drone drone1 depot loc19)
   deleted: (at drone1 depot)
   added: (at drone1 loc19)
   goals met: 11 of 21
49. (deliver-arm2 drone1 person2 crate11 medicine loc19)
   deleted: (arm2-load drone1 crate11) (person-needs person2 medicine)
   added: (arm2-free drone1) (person-has person2 medicine)
   goals met: 12 of 21
50. (move-drone drone1 loc19 depot)
   deleted: (at drone1 loc19)
   added: (at drone1 depot)
   goals met: 13 of 21
51. (grab-arm2 drone1 crate17 depot)
   deleted: (arm2-free drone1) (at crate17 depot)
   added: (arm2-load drone1 crate17)
   goals met: 13 of 21
52. (grab-arm1 drone1 crate15 depot)
   deleted: (arm1-free drone1) (at crate15 depot)
   added: (arm1-load drone1 crate15)
   goals met: 13 of 21
53. (move-drone drone1 depot loc18)
   deleted: (at drone1 depot)
   added: (at drone1 loc18)
   goals met: 12 of 21
54. (deliver-arm2 drone1 person1 crate17 medicine loc18)
   deleted: (arm2-load drone1 crate17) (person-needs person1 medicine)
   added: (arm2-free drone1) (person-has person1 medicine)
   goals met: 13 of 21
55. (move-drone drone1 loc18 loc6)
   deleted: (at drone1 loc18)
   added: (at drone1 loc6)
   goals met: 13 of 21
56. (deliver-arm1 drone1 person3 crate15 medicine loc6)
   deleted: (arm1-load drone1 crate15) (person-needs person3 medicine)
   added: (arm1-free drone1) (person-has person3 medicine)
   goals met: 14 of 21
57. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 15 of 21
58. (grab-arm1 drone1 crate12 depot)
   deleted: (arm1-free drone1) (at crate12 depot)
   added: (arm1-load drone1 crate12)
   goals met: 15 of 21
59. (grab-arm2 drone1 crate19 depot)
   deleted: (arm2-free drone1) (at crate19 depot)
   added: (arm2-load drone1 crate19)
   goals met: 15 of 21
60. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 14 of 21
61. (deliver-arm1 drone1 person11 crate12 medicine loc6)
   deleted: (arm1-load drone1 crate12) (person-needs person11 medicine)
   added: (arm1-free drone1) (person-has person11 medicine)
   goals met: 15 of 21
62. (move-drone drone1 loc6 loc18)
   deleted: (at drone1 loc6)
   added: (at drone1 loc18)
   goals met: 15 of 21
63. (move-drone drone1 loc18 loc9)
   deleted: (at drone1 loc18)
   added: (at drone1 loc9)
   goals met: 15 of 21
64. (deliver-arm2 drone1 person4 crate19 medicine loc9)
   deleted: (arm2-load drone1 crate19) (person-needs person4 medicine)
   added: (arm2-free drone1) (person-has person4 medicine)
   goals met: 16 of 21
65. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 17 of 21
66. (grab-arm1 drone1 crate16 depot)
   deleted: (arm1-free drone1) (at crate16 depot)
   added: (arm1-load drone1 crate16)
   goals met: 17 of 21
67. (grab-arm2 drone1 crate18 depot)
   deleted: (arm2-free drone1) (at crate18 depot)
   added: (arm2-load drone1 crate18)
   goals met: 17 of 21
68. (move-drone drone1 depot loc2)
   deleted: (at drone1 depot)
   added: (at drone1 loc2)
   goals met: 16 of 21
69. (deliver-arm1 drone1 person13 crate16 medicine loc2)
   deleted: (arm1-load drone1 crate16) (person-needs person13 medicine)
   added: (arm1-free drone1) (person-has person13 medicine)
   goals met: 17 of 21
70. (move-drone drone1 loc2 loc12)
   deleted: (at drone1 loc2)
   added: (at drone1 loc12)
   goals met: 17 of 21
71. (deliver-arm2 drone1 person14 crate18 medicine loc12)
   deleted: (arm2-load drone1 crate18) (person-needs person14 medicine)
   added: (arm2-free drone1) (person-has person14 medicine)
   goals met: 18 of 21
72. (move-drone drone1 loc12 depot)
   deleted: (at drone1 loc12)
   added: (at drone1 depot)
   goals met: 19 of 21
73. (grab-arm2 drone1 crate14 depot)
   deleted: (arm2-free drone1) (at crate14 depot)
   added: (arm2-load drone1 crate14)
   goals met: 19 of 21
74. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 18 of 21
75. (deliver-arm2 drone1 person17 crate14 medicine loc5)
   deleted: (arm2-load drone1 crate14) (person-needs person17 medicine)
   added: (arm2-free drone1) (person-has person17 medicine)
   goals met: 19 of 21
76. (move-drone drone1 loc5 loc7)
   deleted: (at drone1 loc5)
   added: (at drone1 loc7)
   goals met: 19 of 21
77. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 20 of 21
78. (grab-arm2 drone1 crate20 depot)
   deleted: (arm2-free drone1) (at crate20 depot)
   added: (arm2-load drone1 crate20)
   goals met: 20 of 21
79. (move-drone drone1 depot loc10)
   deleted: (at drone1 depot)
   added: (at drone1 loc10)
   goals met: 19 of 21
80. (deliver-arm2 drone1 person19 crate20 medicine loc10)
   deleted: (arm2-load drone1 crate20) (person-needs person19 medicine)
   added: (arm2-free drone1) (person-has person19 medicine)
   goals met: 20 of 21
81. (move-drone drone1 loc10 depot)
   deleted: (at drone1 loc10)
   added: (at drone1 depot)
   goals met: 21 of 21
